# Name Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeReferenceOptions..::..Name Property
DirectShapeReferenceOptions Class See Also
---
The name associated with the reference object. The name does not need to be unique. The name must not be empty and must contain valid characters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: value cannot be used as a name for the direct shape reference. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace